'''Реализуйте алгоритм игры “Тайный Санта (Secret Santa)” .
В шляпу кладутся небольшие записки с именами участников.
Затем каждый играющий по очереди вытягивает бумажку с именем того, кому предстоит вручить презент.
 Ваша программа должна используя список имен участников выдать на выходе пары,
 кто и кому будет дарить, причем сам себе человек не может подарить,
дубликаты тоже не допустимы.'''



import random as rd

ts = ["Alex","Olga","Max","Denis","Nick"]

rd.shuffle(ts)

for i in range(-1, len(ts)-1):
    print(f'{ts[i]} = {ts[i+1]}')

